src/main/test/supply-chain/4-Finalization/0-Apply Tax/0-Tax Registration Number/1-TC_04.01.02_ApplyTax_TaxRegistrationNumber_not_needed/0-TC_04.01.02_01_ApplyTax_TaxRegistrationNumber_not_needed_NetAmount/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ws="http://ws.tim.ikea.com/">
   <soap:Header/>
   <soap:Body>
      <ws:applyTax><!--Optional:-->
  <arg0><DocumentId>
    <SystemSourceId>FRIM001</SystemSourceId>
    <TransactionId/>
  </DocumentId>
  <AlternateDocumentId>
    <CustomField1>CustomField1</CustomField1>
    <CustomField2/>
    <CustomField3/>
    <CustomField4/>
    <CustomField5/>
    <CustomField6/>
    <CustomField7/>
    <CustomField8/>
    <CustomField9/>
    <CustomField10/>
  </AlternateDocumentId>
  <InvoiceLanguage>
    <LanguageCode>en</LanguageCode>
    <LanguageCountryCode>GB</LanguageCountryCode>
  </InvoiceLanguage>
  <CommunicationLanguage>
    <LanguageCode>en</LanguageCode>
    <LanguageCountryCode>GB</LanguageCountryCode>
  </CommunicationLanguage>
  <GrossPriceCalculation>N</GrossPriceCalculation>
  <CalculationDecimalPlaces>0</CalculationDecimalPlaces>
  <PreviousInvoiceTaxCountry/>
  <TaxDecisionSet>
    <TaxDecisionSetId/>
    <SellerTaxIndicator>
      <TaxIndicatorAbbreviation/>
      <TaxIndicatorName/>
      <TaxIndicatorComment/>
    </SellerTaxIndicator>
    <SellerTaxCountry/>
    <SellerTaxState/>
    <BuyerTaxIndicator>
      <TaxIndicatorAbbreviation/>
      <TaxIndicatorName/>
      <TaxIndicatorComment/>
    </BuyerTaxIndicator>
    <BuyerTaxCountry/>
    <BuyerTaxState/>
    <CombinedTaxIndicator/>
    <CommercialIndicator/>
    <SellerTaxRegCountry/>
    <SellerTaxRegState/>
    <BuyerTaxRegCountry/>
    <BuyerTaxRegState/>
	<GrossPriceCountry/>
    
    <TaxComment>
      <TaxCommentType/>
      <TaxCommentText/>
    </TaxComment>
    <InvoiceCurrency>
      <CurrencyCode>EUR</CurrencyCode>
      	<SellerLocalTaxCurrencyExchangeRate/>
      	<SellerLocalTaxCurrencyCode/>
      
	<BuyerLocalTaxCurrencyExchangeRate/>
      
	<BuyerLocalTaxCurrencyCode/>
    </InvoiceCurrency>
    <LegalTaxCalculationLevel/>
    <TaxInvoiceLine>
      <LineNumber>1</LineNumber>
      <ItemNo>1</ItemNo>
      <ItemType/>
      <UNSPSC>10200000</UNSPSC>
      <Classification/>
      <SubClassification/>
      <CountryItemClassification/>
      <NetAmount>10.0</NetAmount>

      <VariableTaxSteeringInput>

        <ConsignorCountry/>
        <ConsignorState/>

        <ConsignorBusinessUnitCode/>

        <ConsignorBusinessUnitType/>

        <ConsigneeCountry/>

        <ConsigneeState/>

        <ConsigneeBusinessUnitCode/>

        <ConsigneeBusinessUnitType/>

        <CarrierCountry/>

        <CarrierState/>

        <CarrierBusinessUnitCode/>

        <CarrierBusinessUnitType/>

        <ShipmentStartCountry/>

        <ShipmentEndCountry/>

        <ShipmentStartState/>

        <ShipmentEndState/>

        <ServiceRenderedCountry/>

        <ServiceRenderedState/>

        <ResalePurpose/>

        <IsOutBonded/>

        <IsInBonded/>

        <TaxPreAlgorithmOutput>

          <IsExport/>

          <IsImport/>

          <IsExported/>

          <IsImported/>

        </TaxPreAlgorithmOutput>

        <ShippingOfCustomsClearedGoods/>

      </VariableTaxSteeringInput>
    </TaxInvoiceLine>
    
  </TaxDecisionSet>
  <TaxDate>
    <TaxAlgorithmDate>2014-02-12</TaxAlgorithmDate>
    <TaxCalculationDate/>
  </TaxDate>
  <TaxModuleBehaviour>
    <SkipCalculation>N</SkipCalculation>
    <SkipDecision>N</SkipDecision>
  </TaxModuleBehaviour>
  <VariableTaxSteeringInput>
    <ConsignorCountry/>
    <ConsignorState/>
    <ConsignorBusinessUnitCode>4960</ConsignorBusinessUnitCode>
    <ConsignorBusinessUnitType>COM</ConsignorBusinessUnitType>
    <ConsigneeCountry/>
    <ConsigneeState/>
    <ConsigneeBusinessUnitCode>3101</ConsigneeBusinessUnitCode>
    <ConsigneeBusinessUnitType>COM</ConsigneeBusinessUnitType>
    <CarrierCountry/>
    <CarrierState/>
    <CarrierBusinessUnitCode/>
    <CarrierBusinessUnitType/>
    <ShipmentStartCountry/>
    <ShipmentEndCountry/>
    <ShipmentStartState/>
    <ShipmentEndState/>
    <ServiceRenderedCountry/>
    <ServiceRenderedState/>
    <ResalePurpose>N</ResalePurpose>
    <IsOutBonded>N</IsOutBonded>
    <IsInBonded>N</IsInBonded>
    <TaxPreAlgorithmOutput>
      <IsExport>Y</IsExport>
      <IsImport>N</IsImport>
      <IsExported>N</IsExported>
      <IsImported>N</IsImported>
    </TaxPreAlgorithmOutput>
    <ShippingOfCustomsClearedGoods/>
  </VariableTaxSteeringInput>
  <BuyerParty>
    <Party>
      <BusinessUnitCode>7520</BusinessUnitCode>
      <BusinessUnitType>COM</BusinessUnitType>
      <BusinessUnitName/>
      <PartyAddress>
        <AddressType/>
        <City/>
        <PostBox/>
        <Street/>
        <ZipCode/>
        <CountryCode/>
        <StateCode/>
        <CountryOfLegalRegistration/>
      </PartyAddress>
    </Party>
	<CustomerID/>
  </BuyerParty>
  <SellerParty>
    <Party>
      <BusinessUnitCode>4960</BusinessUnitCode>
      <BusinessUnitType>COM</BusinessUnitType>
      <BusinessUnitName/>
      <PartyAddress>
        <AddressType/>
        <City/>
        <PostBox/>
        <Street/>
        <ZipCode/>
        <CountryCode/>
        <StateCode/>
        <CountryOfLegalRegistration/>
      </PartyAddress>
    </Party>
  </SellerParty>
<TermOfDelivery>DDU</TermOfDelivery></arg0>
      </ws:applyTax>
   </soap:Body>
</soap:Envelope>